package com.lee.test;

/**
 * @author
 * @create 2018-09-18 16:04
 **/
public class TestFindAlert {





  public static void main(String [] args )
  {

      String s = "湖南省衡阳市衡南噢噢噢哦哦陌陌现在收13786354682";

      String ss = "湿唇|我操你|我操女人|我日|吸精|洗Ｂ|书友群|17K111|销魂|小逼|大法|小弟弟|小穴|性爱|性暴力|性高潮|性行为|性交|性奴|性虐待|性骚扰|性生活|胸罩|學生妹|穴淫|寻欢|颜射|阳 具|咬着龟头|要射了|一夜情|阴门|阴屄|阴唇|阴道|阴蒂|阴缔|阴阜|阴核|阴户|阴茎|阴精|阴茎插小穴|阴毛|阴囊|阴水|淫逼|淫虫|淫荡美女|淫妇|淫贱|淫叫|淫浪|淫流|淫乱|淫亂|淫糜|淫魔|淫母|淫妞|淫奴|淫女|淫片|淫情|淫色|淫声浪语|淫水|淫娃|淫穴|淫欲|淫汁|应召|幼交|幼齿|诱奸|玉穴|援交|援交妹|援助交易|造爱|子宫|自摸|自慰|足交|作爱|做爱|做愛|坐交|坐台打泡|大纪元|法轮|法轮功|李洪志|明惠|转法轮|自焚|胡锦涛|江泽民|毛泽东|邓小平|一党|多党|民主|专政|民运|六四|台独|藏独|西藏独立|疆独|新疆独立|暴动|暴乱|八九|赤匪|赤化|达赖|第四代|东北独立|动乱|動乱|独裁|发伦|发沦|发轮|发论|法伦|法沦|法輪功|法论|反攻|反共|分裂|封杀|封锁|腐败|高干|高官|根敦·确吉尼玛|工自联|高学联|高字联|高自联|功法|我操你妈|操你老母|共铲党|共党|共匪|共狗|红色恐怖|红志|胡紧掏|胡锦滔|胡锦淘|胡錦濤|护法|华国锋|黄菊|回民暴动|火药制作|基督|江流氓|江则民|江贼民|江折民|江猪|江猪媳|江主席|将则民|僵贼|僵贼民|讲法|酱猪媳|接班|锦涛|九评共产党|老江|老毛|李长春|李大师|李登辉|李红痔|李宏志|李岚清|李老师|李鹏|易斯|一夜|情人|幼 交|小妞|插 她|玩偶|娇妻|流氓|情夫|小寡妇|老公们|禽兽|春色|春光|春梦|猛男|艳星|艳行|艳遇|艳记|艳事|艳史|寡妇|金瓶|禁果|小护士|浴女|外遇|欲望|变态|同居|诱惑|缠绵|暧昧|纵情|饥渴|出轨|呻吟|闷骚|风骚|堕落|沉沦|御用|调情|调戏|调教|风流|不良|寻欢|合欢|偷情|偷腥|挑情|同眠|舔|美少妇|群 交|狗 操|放荡|最高级|www111|内蕊|坏蛋|淫荡|白洁|少妇|最好|最高|最新|金牌|优秀|全网销量第一|顶级工艺|最新科学|终极|王牌|冠军|爆炸|事件|砍刀|持刀|国家级|世界级|最佳|第一|唯一|首个|最大|精确|顶级|最低|最具|最新技术|最先进科学|国家级产品|最便宜|最新|最先进|最大程度|最填补国内空白|绝对|独家|首家|第一品牌|最先|顶级|独家|全球首发|全国首发|世界领先|最新技术|最先进加工工艺|最时尚|极品|顶尖|最受欢迎|NO.1111|Top1|极致|永久|王牌|掌门人|领袖品牌|独一无二|绝无仅有|前无古人|史无前例|万能|PS111|暴力|袭击|暴徒|东突|香港|杀人|嫌疑犯|艾滋病|伊斯兰教|猪肉|扫射|关闭互联网|路障|剿灭|全能神|暴乱|流窜|流蹿|策划|昆明|火车站|公安|斩人|割喉|砍杀|防爆|沙依巴克|柯尔克孜|阿图什|疆独|维族|炸|针管|抓捕|强奸|镇压|枪杀|抗议|蒙面妇女|戴头巾|异教徒|宵禁|互联网关闭|枪决|极端宗教|新疆|恐怖|暴恐|和田|维吾尔|灭族|连坐|砍人|暴动|作案|1113.1111|3。01111|特警|防暴|伺机|刀|早市|乌鲁木齐|阿克苏|克孜勒苏|拘捕|击毙|集会|聚集|反恐|油库|伊斯兰|清真|毒血|反华|军警|强暴|伤亡|断网|喜欢销售的朋友|李瑞环|李先念|李小朋|http://blog.sina.com.cn|ps：111|题外话：|手机充值地址：|幽道|请勿转载|花蕊|小贱逼|MD真是|我操！|我操他姥姥|我日你祖宗|日你老母|我日你妈|我日他姥姥|我操，|他妈的|傻逼|傻B|贱逼|贱人|我操你妈的|我操他妈的|妈了个比|原创网|潇湘|天安门事件|娇吟|感官刺激|左右摆动|弄湿了床单|男性欲望|腰肢|内壁|低吼|湿漉漉|粗喘|胴体|飘飘欲仙|大法|大纪元|法轮|法轮功|李洪志|明惠|转法轮|自焚|一党专制|疆独|八九|赤匪|共铲党|共狗|红色恐怖|护法|将则民|僵贼|僵贼民|九评共产党|老毛|李红痔|李宏志|小穴|感官刺激|左右摆动|弄湿了床单|高潮|底裤|抽送|乳尖|挣扎|内壁|低吼|湿漉漉|她穴内|呻吟|嘿咻|反复滑动|<111|>111|禁地|长驱直入|吮吸|津液|迸射出|硬挺|肿胀|小穴|欲仙欲死|高潮|底裤|抽送|乳尖|挣扎|男性的胯间|私处|她穴内|呻吟|四肢酥软|做爱|民运|六四|藏独|西藏独立|新疆独立|暴乱|赤化|法輪功|共匪|红志|回民暴动|江猪媳|讲法|酱猪媳|老江|李大师|李老师|自由之门|娇吟|欲仙欲死|男性欲望|腰肢|男性的胯间|私处|粗喘|四肢酥软|胴体|上床|性爱|内蕊|昂挺|蓓蕾|双腿间|变硬|坚挺|淑乳|冲刺|我操你大爷|※|双乳|思春|丝袜|舔逼|舔脚|舔屁眼|同性|偷欢|推油|吞精|脱光|脫褲|脱裤|脱内裤|脫衣|脱衣|外阴|慰安妇|我操|xs8|hongxiu|jjwxc|.net111|qidian|给我投票|@snda.com|bookspice|起点书号|未完待续|http://111|小说网|共产共妻|二奶|湿穴|正版阅读|分界线|红袖添香|处女|江流氓|江则民|江贼民|江折民|江猪|江猪媳|江主席|将则民|僵贼|僵贼民|讲法|酱猪媳|接班|锦涛|九评共产党|老江|老毛|李长春|李大师|李登辉|李红痔|李宏志|李岚清|李老师|李鹏|李瑞环|李先念|李小朋|大奶波|www111|大咪咪|大奶头|大屁股|大乳|大阴|荡妇|蕩妹|荡女|底裤|多人群交|多人性爱|二 奶|二逼|发浪|发 情|发骚|放荡|肥 逼|肥穴|粉穴|风骚|风骚乳房|风骚侍女|干 你|干炮|幹炮|干屁眼|干死|干他|干她|干穴|肛|肛交|肛门|高潮|睾丸|狗b|狗 操|龟头|龜頭|含屌|行房|红灯区|后庭|鸡巴|鸡巴暴胀|鸡吧|鸡鸡|鸡奸|鷄巴|妓女|奸 淫|贱逼|贱货|脚交|叫床|叫春|精液|菊花蕾|巨奶|巨乳|开苞|抠穴|口活|口技|口交|口淫|狂操|狂操女人|狂干|烂逼|烂比|浪妇|浪叫|浪女|浪穴|老二|蕾絲|露B|露逼|露波|露股沟|露毛|露奶|露乳|露体|露臀|露胸|露穴|露阴毛|乱交|乱伦|亂倫|轮暴|轮奸|裸乳|裸身|裸體|卖逼|卖比|卖身|美少妇|妹疼|妹痛|闷骚|猛插|秘唇|蜜穴|母子|奶水|奶头|奶子|内裤|内射|嫩屄|嫩逼|嫩女|嫩穴|尿道|尿急|尿尿|女护士|女学生|爱 液|扒穴|掰穴|包二奶|包皮|暴干|暴奶|暴乳|暴淫|被操|被插|被干|逼奸|避孕套|变态|波霸|不良少女|操b|操屄|操逼|操烂|操了|操你|操你妈|操死|操他|操我|操穴|草莓牛奶|插|插 他|插 她|插b|插插|插你|插入|插我|插穴|猖妓|娼妓|潮吹|吃精|抽插|处女|处女膜|吹 萧|春药|打 炮|大逼|大波|大花逼|大鸡巴|大力抽送|蹂躪|大陆|肉棒|肉 棍|肉唇|妓院|妓女|情妇|女阴|一夜情|女淫|女佣|女優|哦哦|喷火|喷精|噴精|喷尿|屁眼|嫖|嫖娼|破处|强暴|强奸|强歼|强奸处女|全露|全裸|群 交|群 射|群奸|人奶|人妻|人兽交|人與獸|日本骚货|日本性|日本性爱|日逼|露乳|露体|露臀|露胸|露穴|露阴毛|乱交|乱伦|亂倫|轮暴|轮奸|裸乳|裸身|裸體|卖逼|卖比|卖身|妹疼|妹痛|猛插|秘唇|蜜穴|奶头|奶子|嫩屄|嫩逼|嫩女|嫩穴|尿道|女阴|女淫|女佣|女優|哦哦|喷火|喷精|噴精|喷尿|屁眼|嫖|嫖娼|破处|强暴|强奸|强歼|强奸处女|全露|全裸|群交|群射|群奸|人奶|人妻|人兽交|人與獸|日本骚货|日本性|日本性爱|日逼|蹂躪|肉棍|肉棒|肉唇|肉洞|肉缝|肉沟|肉棍干骚妇|肉茎|肉具|肉蒲团|肉色|肉絲|肉穴|肉欲|乳沟|乳房|乳交|乳头|乳晕|撒尿|三角地带|骚逼|骚洞|骚妇|骚货|骚妹|骚女|骚女叫春|骚水|骚穴|色情|色欲|少女高潮|射精|失禁|失身|手淫|兽奸|兽交|獸交|兽欲|双峰|双沟|AV111|A片|anal111|bigcock|freesex|fuck|G点高潮|sex111|SM|爱液|扒穴|掰穴|包二奶|包皮|暴干|暴奶|暴乳|暴淫|被操|被插|被干|逼奸|波霸|不良少女|操b|操屄|操逼|操烂|操了|操你|操你妈|操死|操他|操我|操穴|草莓牛奶|插他|插她|插b|插插|插你|插穴|猖妓|娼妓|潮吹|吃精|抽插|处女|处女膜|吹萧|春药|打炮|大逼|大波|大花逼|大鸡巴|大力抽送|大咪咪|大奶波|大奶头|大屁股|大乳|大阴|荡妇|蕩妹|荡女|底裤|多人群交|多人性爱|二奶|二逼|发浪|发 情|发骚|肥 逼|肥穴|粉穴|风骚|风骚乳房|风骚侍女|干你|干炮|幹炮|干屁眼|干死|干他|干她|干穴|肛交|肛门|睾丸|狗b|狗操|龟头|龜頭|含屌|行房|后庭|鸡巴|鸡巴暴胀|鸡吧|鸡鸡|鸡奸|鷄巴|妓女|奸淫|贱逼|贱货|脚交|叫床|叫春|精液|菊花蕾|巨奶|巨乳|开苞|抠穴|口活|口技|口交|口淫|狂操|狂操女人|狂干|烂逼|烂比|浪妇|浪叫|浪女|浪穴|蕾絲|露B|露逼|露波|露股沟|露毛|露奶|anal111|AV111|A片|bigcock|freesex|fuck|G点高潮|sex111|SM|二奶|乳房|罩杯|色狼|处女|床伴|青楼|内裤|底裤|内衣|亵衣|色魔|熟女|避孕套|婊子|波霸|初夜|蕾丝|老鸨|包养|上床|蹂躏|采花|偷欢|赤裸|猎艳|勾引|迷奸|强奸|好色|淫荡|高潮|自慰|偷精|卖淫|性爱|性骚扰|意淫|破处|吹箫|打炮|失身|失禁|虐恋|虐爱|虐情|共产|共产党|易斯|弟子|大陆|女学生|中出|洗脚|洗浴|下部|下身|小便|穴|阴 门|淫|肉丝|乳 沟|骚|熟 女|爱 液|避孕套|变态|插|插 他|插入|插我|吹 萧|打 炮|肉 棍|闷骚|母子|奶水|内裤|内射|尿急|尿尿|女护士|群 射|红灯区|奸 淫|老二|二 奶|干 你|肛|net111|投票|QQ111|QQ群|一党专制|自由之门|嘿咻|反复滑动|歹徒|肉洞|肉缝|肉沟|肉棍干骚妇|肉茎|肉具|肉蒲团|肉色|肉丝|肉絲|肉穴|肉欲|乳 沟|乳房|乳交|乳头|乳晕|撒尿|三角地带|骚|骚逼|骚洞|骚妇|骚货|骚妹|骚女|骚女叫春|骚水|骚穴|色情|色欲|上床|少女高潮|射精|呻吟|失禁|失身|手淫|兽奸|兽交|獸交|兽欲|熟 女|双峰|双沟|双乳|思春|丝袜|舔|舔逼|舔脚|舔屁眼|同性|偷欢|推油|吞精|脱光|脫褲|脱裤|脱内裤|脫衣|脱衣|外阴|慰安妇|我操|我操你|我操女人|我日|吸精|洗Ｂ|洗脚|洗浴|下部|下身|销魂|小逼|小便|小弟弟|小穴|性爱|性暴力|性高潮|性行为|性交|性奴|性虐待|性骚扰|性生活|胸罩|穴|學生妹|穴淫|寻欢|颜射|阳 具|咬着龟头|要射了|一夜情|阴 门|阴屄|阴唇|阴道|阴蒂|阴缔|阴阜|阴核|阴户|阴茎|阴精|阴茎插小穴|阴毛|阴囊|阴水|淫|淫逼|淫虫|淫荡美女|淫妇|淫贱|淫叫|淫浪|淫流|淫乱|淫亂|淫糜|淫魔|淫母|淫妞|淫奴|淫女|淫片|淫情|淫色|淫声浪语|淫水|淫娃|淫穴|淫欲|淫汁|应召|幼 交|幼齿|诱奸|玉穴|援交|援交妹|援助交易|造爱|中出|子宫|自摸|自慰|足交|作爱|做爱|做愛|坐交|坐台打泡|大法|大纪元|法轮|法轮功|李洪志|明惠|转法轮|自焚|胡锦涛|江泽民|毛泽东|邓小平|一党|多党|民主|专政|民运|六四|台独|藏独|西藏独立|疆独|新疆独立|暴动|暴乱|八九|赤匪|赤化|net111|投票|QQ111|QQ群|达赖|弟子|第四代|东北独立|动乱|動乱|独裁|发伦|发沦|发轮|发论|法伦|法沦|法輪功|法论|反攻|反共|分裂|封杀|封锁|腐败|高干|高官|根敦·确吉尼玛|工自联|高学联|高字联|高自联|功法|共产|共产党|共铲党|共党|共匪|共狗|红色恐怖|红志|胡紧掏|胡锦滔|胡锦淘|胡錦濤|护法|华国锋|黄菊|回民暴动|火药制作|基督|砸票|拉票|一夜情|江、胡十";


      String[] arr = ss.split("\\|");


      for( int i = 0 ; i < arr.length ;i++)
      {


          if (s.contains(arr[i]) )
          {
            System.out.println("找到敏感词" + arr[i]);
          }



      }



  }
}
